<?php
    $page_title = 'Автор';
?>

<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <title>Maksym Stefanko</title>
        <link rel="stylesheet" type="text/css" href="style.css">
    </head>
    <body>
        <div class="container">
             <?php require 'header_aside.php';?>
            <div class="main">
                <h2>Про автора</h2>
                <p>Стефанко Максим Богданович народився 1995 року в місті Коломия Івано-Франківської області. Після закінчення школи вступив
                    у Чернівецький Національний Університет на інженерно-технічний факультет. У 2016 році отримав диплом бакалавра за спеціальністю телекомунікації.
                    Також отримав додаткову освіту закінчивши курс CCNA академії Cisco. На даний момент навчається на 5-му курсі університету і проживає в місті Чернівці. 
                    Досвід у сфері веб-програмування складає 2 роки. Останні 6 місяців активно працює в якості фрілансера. Спеціалізуюсь як фронтенд розробник з впевненими
                    знаннями HTML5, CSS3, Javascript. З фрейворків і бібліотек в основному використовую - jQuery, VueJs, Bootstrap, SematicUI, Animate.css, WoWJs.
                    Є досвід роботи з AngularJs і Angular 2 for TypeScript. Присутній досвід роботи з серверними програмами і базові знання PHP і NodeJs.
                    Впевнено володію мовою запитів до баз даних SQL. Також є деякий досвід роботи зі Swift і створення програм для IOS. 
                    Впевнені знання основних понять про будову комп'ютерних мереж, клієнт серверну взаємодію, маршрутизації, комутації, мережеві протоколи, служби та технології.
                    Володію англійською мовою на розмовному рівні.
                     
                    
                </p>
            </div>
            <footer>Автор: Стефанко Максим &copy <br> 2017 рік
            </footer>
        </div>
    </body>
</html>
